src/InformationRegisters/KFK_ОчередьДействийПослеОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>KFK_ОчередьДействийПослеОбмена</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>НаборЗначений</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОбмена</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстОшибки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОбработки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМетаданных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Действие</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.KFK_КлассификаторДействийСОбъектамиОчередиПослеОбмена</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОперации</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>72</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Enums/KFK_ВидыОбработкиОчереди.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>KFK_ВидыОбработкиОчереди</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>РучнаяОбработкаОчереди</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>АвтоматическаяОбработкаОчереди</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/InformationRegisters/KFK_ОчередьДействийПослеОбмена/Forms/ФормаСписка/Ext/Form/Module.bsl
#Область Переменные

&НаКлиенте
Перем ПараметрыОбработчикаОжидания, 
	ФормаДлительнойОперации;
	
#КонецОбласти //Переменные


#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Отбор") И ТипЗнч(Параметры.Отбор) = Тип("Структура") И 
		Параметры.Отбор.Свойство("Объект") И ЗначениеЗаполнено(Параметры.Отбор.Объект) Тогда
		
		ТекущийОбъектОбмена = Параметры.Отбор.Объект;
	КонецЕсли;
	   
	СтруктураРеквизитовФормы = Новый Структура;
	СтруктураРеквизитовФормы.Вставить("ИдентификаторЗадания");

	Если ЗначениеЗаполнено(ТекущийОбъектОбмена) Тогда
		Элементы.ФормаВыполнитьВсеОперации.Видимость = ложь;
		Элементы.ФормаОчистить.Видимость = ложь;
		Элементы.ФормаВыполнитьОтмеченныеОперации.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти //ОбработчикиСобытийФормы


#Область ОсновныеДействия
	
&НаСервере
Функция ВыполнитьДействияОчереди(СоответствиеДействий, ВыбранныеОбъекты = ложь)
	ЗаданиеВыполнено = Ложь;
	
	НеИспользоватьФоновыеЗадания = Константы.KFK_НеИспользоватьФоновыеЗаданияОбработкиОчереди.Получить();
	
	НаименованиеЗадания = НСтр("ru = 'Обработка очереди действий'");	
	Если ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая Тогда
		ВремяОжидания = 4;
	Иначе
		ВремяОжидания = 2;
	КонецЕсли;
	
	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(СоответствиеДействий);     
	МассивПараметров.Добавить(Неопределено);   
	МассивПараметров.Добавить("");
	МассивПараметров.Добавить(ВыбранныеОбъекты);
	
	// проверка запущенных фоновых - обработка очереди обмена
	// если у нас есть любая обработка очереди - ручная или автоматическая - запрещаем запуск
	// обработки очереди	
	МассивФоновыхЗаданий = ФоновыеЗадания.ПолучитьФоновыеЗадания(Новый Структура("ИмяМетода, Состояние", "ВИ_РаботаСОчередьюПослеОбмена.ОбработатьОчередьДействийПослеОбмена", СостояниеФоновогоЗадания.Активно));
	Если МассивФоновыхЗаданий.Количество() Тогда
		
		ТекстПредупреждения = "Задание обработки очереди после обмена не смогло запуститься по причине уже запущеного аналогичного задания. 
							  |Дождитесь завершения задания и запустите обработку очереди вручную из регистра сведений <Очередь действий после обмена>";
		
		ЗаписьЖурналаРегистрации("Обмен регл.", УровеньЖурналаРегистрации.Предупреждение,,, ТекстПредупреждения);
		KFK_ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
		
		Возврат Истина;
		
	Иначе
		// заносим информацию в РС: KFK_ИсторияВыполненияЗаданийОбработкиОчереди, что на данный момент запущена обработка очереди
		// это необходимо для избежания коллизий
		ИнформацияОбОшибке = "";
		Если НеИспользоватьФоновыеЗадания Тогда
			ИдентификаторОперации = СокрЛП(Новый УникальныйИдентификатор);
			Попытка
				ВИ_РаботаСОчередьюПослеОбмена.ОбработатьОчередьДействийПослеОбмена(СоответствиеДействий, Неопределено, "", ВыбранныеОбъекты);
			Исключение
				// если запустили не фоновыми заданиями, то могла быть ошибка
				// в процессе обработки очереди
				ИнформацияОбОшибке = ОписаниеОшибки();
			КонецПопытки;
			
		Иначе
			
			Задание = ФоновыеЗадания.Выполнить("ВИ_РаботаСОчередьюПослеОбмена.ОбработатьОчередьДействийПослеОбмена", 
												МассивПараметров, 
												"ОбработатьОчередьДействийПослеОбмена", 
												"Обработать очередь действий после обмена");	
												
			ИдентификаторОперации = СокрЛП(Задание.УникальныйИдентификатор);
			
		КонецЕсли;
		
		РегистрыСведений.ВИ_ФоновыеЗаданияОбменов.ДобавитьЗаписьОНачалеВыполненияФоновогоЗадания(ИдентификаторОперации,
																								 Перечисления.ВИ_РегламентныеОперацииОчереди.РучнаяОбработкаОчереди);
	КонецЕсли;
	                                     
	Попытка
		Если НЕ НеИспользоватьФоновыеЗадания Тогда
			Задание.ОжидатьЗавершения(ВремяОжидания);
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	Попытка
		Если НЕ НеИспользоватьФоновыеЗадания Тогда 
			СтруктураРеквизитовФормы.ИдентификаторЗадания = ИдентификаторОперации;
			
			// Если операция уже завершилась, то сразу обрабатываем результат.
			Если ДлительныеОперации.ЗаданиеВыполнено(Задание.УникальныйИдентификатор) Тогда		
				ЗаданиеВыполнено = Истина;	
				ИнформацияОбОшибке = Задание.ИнформацияОбОшибке;
			КонецЕсли;
		Иначе
			ЗаданиеВыполнено = Истина;	
		КонецЕсли;
	Исключение
	КонецПопытки;
	
	РегистрыСведений.ВИ_ФоновыеЗаданияОбменов.ЗафиксироватьИнформациюОВыполненииФоновогоЗадания(ИдентификаторОперации,
																								Перечисления.KFK_ВидыОбработкиОчереди.РучнаяОбработкаОчереди,
																								ИнформацияОбОшибке);
	Возврат ЗаданиеВыполнено;
				
КонецФункции

&НаКлиенте
Процедура ВыполнитьОперации(Команда)	
	СоответствиеДействий = Новый Соответствие;
	
	// Выполнение выбранных операций
	Если Команда.Имя = "ВыполнитьОтмеченныеОперации" Тогда
		
		Для каждого ВыделеннаяСтрока из Элементы.Список.ВыделенныеСтроки Цикл
			ДанныеСтроки = Элементы.Список.ДанныеСтроки(ВыделеннаяСтрока);		
			Если СоответствиеДействий.Получить(ДанныеСтроки.Действие) = Неопределено Тогда
				СоответствиеДействий.Вставить(ДанныеСтроки.Действие, Новый Массив);
			КонецЕсли;				
			СоответствиеДействий[ДанныеСтроки.Действие].Добавить(ДанныеСтроки.Объект);
		КонецЦикла;
		
		ЗаданиеВыполнено = ВыполнитьДействияОчереди(СоответствиеДействий, истина);
				
	// выполнение всех операций	
	ИначеЕсли Команда.Имя = "ВыполнитьВсеОперации" Тогда
		ЗаданиеВыполнено = ВыполнитьДействияОчереди(СоответствиеДействий);
	КонецЕсли;
		
	Если ЗаданиеВыполнено Тогда
		Состояние("Обработка выбранных операций завершена!");
		Элементы.Список.Обновить();
		Возврат;
	КонецЕсли;	
	
	// Операция еще не завершена, выполняется с помощью фонового задания (асинхронно).
	ПараметрыОбработчикаОжидания = Новый Структура;
	ПараметрыОбработчикаОжидания.Вставить("МинимальныйИнтервал", 1);
	ПараметрыОбработчикаОжидания.Вставить("МаксимальныйИнтервал", 15);
	ПараметрыОбработчикаОжидания.Вставить("ТекущийИнтервал", 1);
	ПараметрыОбработчикаОжидания.Вставить("КоэффициентУвеличенияИнтервала", 1.4);
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", 1, Истина);		
	ФормаДлительнойОперации = ОткрытьФорму("ОбщаяФорма.ДлительнаяОперация", Новый Структура("ИдентификаторЗадания", СтруктураРеквизитовФормы.ИдентификаторЗадания), ЭтаФорма);
		
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПроверитьВыполнениеЗадания()
	
	Попытка
		
		Если ПроверитьВыполнениеЗадания() Тогда 
			ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
			Состояние("Обработка выбранных операций завершена!");
			Элементы.Список.Обновить();
			Возврат;			
		КонецЕсли;
		
	Исключение
		
		ДлительныеОперацииКлиент.ЗакрытьФормуДлительнойОперации(ФормаДлительнойОперации);
		ВызватьИсключение;
		
	КонецПопытки;
	
	ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.ТекущийИнтервал * ПараметрыОбработчикаОжидания.КоэффициентУвеличенияИнтервала;
	
	Если ПараметрыОбработчикаОжидания.ТекущийИнтервал > ПараметрыОбработчикаОжидания.МаксимальныйИнтервал Тогда
		ПараметрыОбработчикаОжидания.ТекущийИнтервал = ПараметрыОбработчикаОжидания.МаксимальныйИнтервал;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("Подключаемый_ПроверитьВыполнениеЗадания", ПараметрыОбработчикаОжидания.ТекущийИнтервал, Истина);
	
КонецПроцедуры

&НаСервере
Функция ПроверитьВыполнениеЗадания()
	
	Если ДлительныеОперации.ЗаданиеВыполнено(Новый УникальныйИдентификатор(СтруктураРеквизитовФормы.ИдентификаторЗадания)) Тогда 
		Возврат Истина;
	Иначе	
		Возврат Ложь;
	КонецЕсли;
	
КонецФункции

&НаКлиенте
Процедура ОткрытьДокумент(Команда)
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущиеДанные.Объект) Тогда
		ПоказатьЗначение(Неопределено, ТекущиеДанные.Объект);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбъект(Команда)
	Если ЗначениеЗаполнено(ТекущийОбъектОбмена) Тогда
		ПараметрыЗаполнения = Новый Структура("Объект, ДатаОбмена, Действие", ТекущийОбъектОбмена, ТекущаяДата(), ДействиеПоУмолчанию);
		ДобавитьОбъектНаСервере(ПараметрыЗаполнения);
	Иначе
		ПараметрыОткрытия = Новый Структура;
		ОткрытьФорму("РегистрСведений.ВИ_ОчередьДействийПослеОбмена.ФормаЗаписи", ПараметрыОткрытия, ЭтаФорма, УникальныйИдентификатор,,, Новый ОписаниеОповещения("ДобавитьОбъектЗавершение", ЭтотОбъект));  
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьОбъектЗавершение(Результат, ДополнительныеПараметры) Экспорт
	Элементы.Список.Обновить();
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ПоказатьВопрос(Новый ОписаниеОповещения("ОчиститьЗавершение", ЭтотОбъект), "Все записи будут удалены с указаным отбором по действию. Продолжить?", РежимДиалогаВопрос.ДаНет);
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ОчиститьЗаписиРегистра();
		Элементы.Список.Обновить();
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ОчиститьЗаписиРегистра()
	ЭлементыОтбора = Список.Отбор.Элементы;
	НаборЗаписей = РегистрыСведений.ВИ_ОчередьДействийПослеОбмена.СоздатьНаборЗаписей();
	Для каждого Отбор из ЭлементыОтбора Цикл
		Если Отбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Действие") И Отбор.Использование И Отбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно Тогда
			НаборЗаписей.Отбор[СокрЛП(Отбор.ЛевоеЗначение)].Установить(Отбор.ПравоеЗначение);
		КонецЕсли;
	КонецЦикла;
	
	НаборЗаписей.Прочитать();
	НаборЗаписей.Очистить();
	НаборЗаписей.Записать();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьОбъектИзКлюча(ВыбраннаяСтрока)
	
	СсылкаНаОбъект = Неопределено;
	
	Если ТипЗнч(ВыбраннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.ВИ_ОчередьДействийПослеОбмена")
		И ЗначениеЗаполнено(ВыбраннаяСтрока.Объект) Тогда
		
		СсылкаНаОбъект = ВыбраннаяСтрока.Объект;
		Если НЕ ЗначениеЗаполнено(СсылкаНаОбъект) Тогда
			СсылкаНаОбъект = Неопределено;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат СсылкаНаОбъект;
	
КонецФункции // ПолучитьОбъектИзКлюча()

&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	Если Поле = Элементы.Объект
		И ТипЗнч(ВыбраннаяСтрока) = Тип("РегистрСведенийКлючЗаписи.ВИ_ОчередьДействийПослеОбмена")
		И НЕ ВыбраннаяСтрока.Пустой() Тогда
		
		СсылкаНаОбъект = ПолучитьОбъектИзКлюча(ВыбраннаяСтрока);
		Если СсылкаНаОбъект <> Неопределено Тогда
			СтандартнаяОбработка = Ложь;
			ПоказатьЗначение(Неопределено, СсылкаНаОбъект);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьОбъектНаСервере(ПараметрыЗаполнения) 
	РегистрыСведений.ВИ_ОчередьДействийПослеОбмена.ДобавитьЗапись(ПараметрыЗаполнения);
	Элементы.Список.Обновить();
КонецПроцедуры

#КонецОбласти //ОсновныеДействия
